=============================================================================
Layer (type:depth-idx)                   Output Shape              Param #
=============================================================================
InceptionNet3                            --                        --
  Sequential: 1-1                        [32, 256, 1, 1]           --
       InceptionA: 2-1                   [32, 256, 32, 32]         --
  	    BatchConv: 3-1               [32, 64, 32, 32]          384
  	    BatchConv: 3-2               [32, 48, 32, 32]          288
	    BatchConv: 3-3               [32, 64, 32, 32]          76,992
	    BatchConv: 3-4               [32, 64, 32, 32]          384
	    BatchConv: 3-5               [32, 96, 32, 32]          55,584
	    BatchConv: 3-6               [32, 96, 32, 32]          83,232
  	    BatchConv: 3-7               [32, 32, 32, 32]          192
       MaxPool2d: 2-2                    [32, 256, 16, 16]         --
       BatchConv: 2-3                    [32, 256, 15, 15]         --
	    Conv2d: 3-8                  [32, 256, 15, 15]         262,400
	    BatchNorm2d: 3-9             [32, 256, 15, 15]         512
	    ReLU: 3-10                   [32, 256, 15, 15]         --
       MaxPool2d: 2-4                    [32, 256, 7, 7]           --
       BatchConv: 2-5                    [32, 256, 6, 6]           --
	    Conv2d: 3-11                 [32, 256, 6, 6]           262,400
	    BatchNorm2d: 3-12            [32, 256, 6, 6]           512
	    ReLU: 3-13                   [32, 256, 6, 6]           --
       MaxPool2d: 2-6                    [32, 256, 3, 3]           --
       BatchConv: 2-7                    [32, 256, 2, 2]           --
	    Conv2d: 3-14                 [32, 256, 2, 2]           262,400
	    BatchNorm2d: 3-15            [32, 256, 2, 2]           512
	    ReLU: 3-16                   [32, 256, 2, 2]           --
       MaxPool2d: 2-8                    [32, 256, 1, 1]           --
  Sequential: 1-2                        [32, 256]                 --
       Linear: 2-9                       [32, 256]                 65,792
       ReLU: 2-10                        [32, 256]                 --
       Dropout: 2-11                     [32, 256]                 --
  Sequential: 1-3                        [32, 128]                 --
       Linear: 2-12                      [32, 128]                 32,896
       ReLU: 2-13                        [32, 128]                 --
  Sequential: 1-4                        [32, 43]                  --
       Dropout: 2-14                     [32, 128]                 --
       Linear: 2-15                      [32, 43]                  5,547
=============================================================================
Total params: 1,110,027
Trainable params: 1,110,027
Non-trainable params: 0
Total mult-adds (G): 9.31
=============================================================================
Input size (MB): 0.39
Forward/backward pass size (MB): 278.11
Params size (MB): 4.44
Estimated Total Size (MB): 282.95
=============================================================================
